books = [] #Создаем список
book1 = {"title": "Жизнь собаки",
         "author": "Ян Керон",
         "year": "2000"} #Создаем словарь

book2 = {"title": "Безумные лорд",
         "author": "Олег Шелонин",
         "year": "2007"} #Создаем словарь

book3 = {"title": "Миниатюры",
         "author": "Александр Рудазов",
         "year": "2007"} #Создаем словарь

book4 = {"title": "Мы, боги",
         "author": "Бернар Вербер",
         "year": "2004"} #Создаем словарь

book5 = {"title": "Логово чужих",
         "author": "Сергей Зверев",
         "year": "2009"} #Создаем словарь

books.append(book1) #Добавляем словарь в список
books.append(book2) #Добавляем словарь в список
books.append(book3) #Добавляем словарь в список
books.append(book4) #Добавляем словарь в список
books.append(book5) #Добавляем словарь в список

for i in range(len(books)): #Используем цикл for
    print("---------------------- Книга", i + 1, "-----------------------") #Выводим номер книги
    print("Название:", books[i]["title"] + ",", "Автор:", books[i]["author"] + ",") #Выводим название и автора
    print("-------------------------" + (books[i]["year"]) + "-------------------------") #Выводим год
